bp/mergeMultiplesMeshes/testCase_2/Allrun
#!/bin/bash

blockMesh > log.blockMesh
ofTutorial3
